/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  UsbSetup.uni

Abstract:
  The definition of string used in  USB Setup setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_COM_EMPTY                      #language en-US ""
                                           #language zh-Hans ""

                                           
#string STR_USB_FORM                       #language en-US "Usb Configuration"
                                           #language zh-Hans ""
#string STR_USB_FORM_HELP                  #language en-US "Usb Configuration"
                                           #language zh-Hans ""
                                           
#string STR_USB_MODE                       #language en-US "Usb Mode"
                                           #language zh-Hans ""
#string STR_USB_MODE_HELP                  #language en-US "Mode 1:EHCI only mode\nMode 2:EHCI and xHCI mode\nMode 3:xHCI only mode\nMode 4:EHCI and xHCI mode (USB2.0 device on P1~P6 controlled by EHCI and on P7~P9 controlled by xHCI)"
                                           #language zh-Hans ""
#string STR_DISABLED                       #language en-US "Disabled"
                                           #language zh-Hans ""
#string STR_MODE1                          #language en-US "Mode 1"
                                           #language zh-Hans ""
#string STR_MODE2                          #language en-US "Mode 2"
                                           #language zh-Hans ""                                           
#string STR_MODE3                          #language en-US "Mode 3"
                                           #language zh-Hans "" 
#string STR_MODE4                          #language en-US "Mode 4"
                                           #language zh-Hans "" 



#string STR_EMPTY                              #language en-US " "
#string STR_USB_MODE                                #language en-US "USB Mode Select"
#string STR_USB_MODE_HELP                               #language en-US "USB Mode Select"

#string STR_DISABLE                           #language en-US "Disable"
#string STR_MODEA                      #language en-US "Mode A"
#string STR_MODEB                              #language en-US "Mode B"
#string STR_MODEC                                #language en-US "Mode C"
#string STR_TRB_CACHE                               #language en-US "TRB Cache Bypass Mode"


#string STR_TRB_CACHE_HELP                           #language en-US "TRB Cache/Stream Context Cache Bypass Mode select"
#string STR_NOT_BYPASS                      #language en-US "Not Bypass"
#string STR_BYPASS                              #language en-US "Bypass"
#string STR_USBC_FLRSUP                      #language en-US "USBC FLR Support"
#string STR_USBC_FLRSUP_HELP                              #language en-US "USBC FLR Enable/Disable select"
#string STR_DISABLED                                #language en-US "Dosabled"
#string STR_ENABLED                               #language en-US "Enabled"

#string STR_XHCI_FLRSUP                           #language en-US "XHCI FLR Support"
#string STR_XHCI_FLRSUP_HELP                      #language en-US "XHCI FLR Enable/Disable select"
 
#string STR_MCUDMA_BYPASS                           #language en-US "MCU DMA Bypass Mode"
#string STR_MCUDMA_BYPASS_HELP                           #language en-US "MCU DMA Bypass/Not Bypass Mode Select"
#string STR_MCU_DMA_NOT_BYPASS                      #language en-US "Not Bypass"
#string STR_MCU_DMA_BYPASS                      #language en-US "Bypass"
   
#string STR_SWITCH_HUB_FW                           #language en-US "Switch Hub Fw"
#string STR_SWITCH_HUB_FW_DISABLE                      #language en-US "Disable Hub Fw Squelch Patch"
#string STR_SWITCH_HUB_FW_ENABLE                      #language en-US "Enable Hub Fw Squelch Patch"  

#string STR_LEGACY_USB_EN                             #language en-US "Legacy Usb Support"
#string STR_LEGACY_USB_EN_HELP                        #language en-US "Legacy Usb Support"


                                         